Conf.Simple/src/InformationRegisters/SUI_ЛогированиеHTTPЗапросов/SUI_ЛогированиеHTTPЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ЛогированиеHTTPЗапросов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КодСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БазовыйURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтносительныйURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДанныеЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеОтвета</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОтветЕстьДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтветЖдать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтветКоманда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтветНетДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>SID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Метод</name>
    <type>
      <types>EnumRef.SUI_HTTPМетоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/CommonModules/SUI_ЛогированиеHTTPЗапросов/Module.bsl
#Область ПрограммныйИнтерфейс

// Записать лог.
// 
// Параметры:
//  HTTPЗапрос - HTTPСервисЗапрос - HTTPЗапрос
//  HTTPОтвет - HTTPСервисОтвет - HTTPОтвет
//	МобильноеУстройство - ПланОбменаСсылка.SUI_МобильныеУстройства - Мобильное устройство
Процедура Записать(HTTPЗапрос, HTTPОтвет, ДанныеЗапроса = Неопределено) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("SUI_ЛогированиеHTTPЗапросов") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(HTTPЗапрос) <> Тип("HTTPСервисЗапрос") Тогда
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Запись'")), 
			УровеньЖурналаРегистрации.Ошибка, Метаданные.ОбщиеМодули.SUI_ЛогированиеHTTPЗапросов, ,
			НСтр("ru = 'Не передан HTTP запрос.'"));
	КонецЕсли;
	
	Если ТипЗнч(HTTPОтвет) <> Тип("HTTPСервисОтвет") Тогда
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Запись'")), 
			УровеньЖурналаРегистрации.Ошибка, Метаданные.ОбщиеМодули.SUI_ЛогированиеHTTPЗапросов, ,
			НСтр("ru = 'Не передан HTTP ответ.'"));
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МобильноеУстройство = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗапроса, "МобильноеУстройство",
		ПланыОбмена.SUI_МобильныеУстройства.ПустаяСсылка(), Тип("ПланОбменаСсылка.SUI_МобильныеУстройства"));
	
	ДополнительныеДанные = Новый Структура();
	ДополнительныеДанные.Вставить("ВерсияПриложения", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДанныеЗапроса, "ВерсияПриложения"));
	ДополнительныеДанные.Вставить("ИдентификаторУстройства", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МобильноеУстройство, "Код"));
	
	УстановитьПривилегированныйРежим(Ложь);

	ДанныеДляЗаписиЛогирования = SUI_ЛогированиеHTTPЗапросовКлиентСервер.ПодготовитьДанныеЗаписиЛогирования(
		HTTPЗапрос, HTTPОтвет, МобильноеУстройство, ДополнительныеДанные);
	
	ЗаписатьЛог(ДанныеДляЗаписиЛогирования);
	
КонецПроцедуры

// Записать лог.
// 
// Параметры:
//  ДанныеДляЗаписиЛогирования - Структура - см. SUI_ЛогированиеHTTPЗапросовКлиентСервер.ПодготовитьДанныеЗаписиЛогирования
Процедура ЗаписатьЛог(ДанныеДляЗаписиЛогирования, ВызыватьИсключения = Ложь) Экспорт
	
	Попытка

		ЛогЗапись = РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.СоздатьМенеджерЗаписи();
		
		ЛогЗапись.Период = ТекущаяДатаСеанса();
		ЛогЗапись.SID = Строка(Новый УникальныйИдентификатор());
		ЗаполнитьЗначенияСвойств(ЛогЗапись, ДанныеДляЗаписиЛогирования);
		ЗаполнитьЗначенияСвойств(ЛогЗапись, ДанныеДляЗаписиЛогирования.Данные);
		ЗаполнитьЗначенияСвойств(ЛогЗапись, ДанныеДляЗаписиЛогирования.Данные.ТипСтруктурыОтвета);
		
		УстановитьПривилегированныйРежим(Истина);
		
		ЛогЗапись.МеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЛогЗапись.НомерСеанса = НомерСеансаИнформационнойБазы();
		ЛогЗапись.ИмяПользователя = ИмяПользователя();
		
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
			ЛогЗапись.ИдентификаторПользователя = Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				ТекущийПользователь, "ИдентификаторПользователяИБ"));
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
		
		ЛогЗапись.Записать(Истина);
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Запись'")), , 
			Метаданные.ОбщиеМодули.SUI_ЛогированиеHTTPЗапросов, , ИнформацияОбОшибке()); 
		Если ВызыватьИсключения Тогда
			ВызватьИсключение;	
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

Функция КоличествоДнейХранения() Экспорт
	Возврат Константы.SUI_ХранениеЛоговHTTPЗапросовВДнях.Получить();
КонецФункции

Процедура ВыполнитьОчисткуЛогов() Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("SUI_ЛогированиеHTTPЗапросов") Тогда
		Возврат;
	КонецЕсли;
	
	ДниХранения = Константы.SUI_ХранениеЛоговHTTPЗапросовВДнях.Получить();
	
	Если Не ЗначениеЗаполнено(ДниХранения) Тогда
		Возврат;
	КонецЕсли;

	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Удаление'")), УровеньЖурналаРегистрации.Примечание, 
		Метаданные.ОбщиеМодули.SUI_ЛогированиеHTTPЗапросов, , НСтр("ru = 'Начало удаления логов HTTP запросов'"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	SUI_ЛогиHTTPЗапросов.Период,
		|	SUI_ЛогиHTTPЗапросов.SID,
		|	SUI_ЛогиHTTPЗапросов.Метод
		|ИЗ
		|	РегистрСведений.SUI_ЛогированиеHTTPЗапросов КАК SUI_ЛогиHTTPЗапросов
		|ГДЕ
		|	SUI_ЛогиHTTPЗапросов.Период < &ДатаНачалаЗаписей
		|
		|УПОРЯДОЧИТЬ ПО
		|	SUI_ЛогиHTTPЗапросов.Период";
	
	Запрос.УстановитьПараметр("ДатаНачалаЗаписей", ТекущаяДатаСеанса() - 86400 * ДниХранения);
	
	Пока Истина Цикл
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();

		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ЛогированиеHTTPЗапросов");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Период", "Период");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("SID", "SID");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Метод", "Метод");
			Блокировка.Заблокировать();
		
			Пока Выборка.Следующий() Цикл
			
				НаборЗаписей = РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.СоздатьНаборЗаписей();
				
				НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
				НаборЗаписей.Отбор.SID.Установить(Выборка.SID);
				НаборЗаписей.Отбор.Метод.Установить(Выборка.Метод);
				
				НаборЗаписей.Записать(Истина);
			
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Удаление'")), ,
				Метаданные.ОбщиеМодули.SUI_ЛогированиеHTTPЗапросов, , ИнформацияОбОшибке());
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;

	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Удаление'")), УровеньЖурналаРегистрации.Примечание, 
		Метаданные.ОбщиеМодули.SUI_ЛогированиеHTTPЗапросов, , НСтр("ru = 'Завершение удаления логов HTTP запросов'"));
	
КонецПроцедуры

#Область УстаревшиеПроцедурыИФункции

// Устарела. см. SUI_ЛогированиеHTTPЗапросов.Записать
Процедура ЛогироватьHTTPЗапрос(Запрос, Ответ, ДвоичныеДанные = Ложь, ОбъектМетаданных = Неопределено) Экспорт
	
	Если Не Константы.SUI_ЛогированиеHTTPЗапросов.Получить() Тогда
		Возврат;		
	КонецЕсли;
	
	Если ОбъектМетаданных = Неопределено Тогда
		ОбъектМетаданных = Метаданные.HTTPСервисы.SUI_Exchange;		
	КонецЕсли;
	
    Описание = ОписаниеЗапроса(Запрос, ДвоичныеДанные) + Символы.ПС + "---" + Символы.ПС + ОписаниеОтвета(Ответ, ДвоичныеДанные);
	                                                                
	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(НСтр("ru = 'Логирование'"), 
		УровеньЖурналаРегистрации.Информация, ОбъектМетаданных,, Описание);
	
КонецПроцедуры

// Устарела.
Функция БазовыйURL(HTTPСервисЗапрос) Экспорт 
	
	БазовыйURL = HTTPСервисЗапрос.Заголовки.Получить("X-Forwarded-Path");
	Если БазовыйURL = Неопределено Тогда
		Возврат НормализоватьАдрес(HTTPСервисЗапрос.БазовыйURL);
	Иначе
		ЧастиАдреса = СтрРазделить(НормализоватьАдрес(HTTPСервисЗапрос.БазовыйURL), "/", Ложь);
		Возврат ЧастиАдреса[0] + "//" + ЧастиАдреса[1] + БазовыйURL;
	КонецЕсли;
	
КонецФункции

// Устарела.
Функция НормализоватьАдрес(Адрес) Экспорт 
	
	ЧастиАдреса = СтрРазделить(Адрес, "/", Ложь);
	
	Протокол = СокрЛП(ЧастиАдреса[0]) + "//";
	ЧастиАдреса.Удалить(0);
	
	ЧастиИмени = СтрРазделить(СокрЛП(ЧастиАдреса[0]), ":");
	ЧастиАдреса.Удалить(0);
	ИмяСервера = ЧастиИмени[0];
	ПортСервера = ?(ЧастиИмени.Количество() = 1, "", СокрЛП(ЧастиИмени[1]));
	Если Протокол = "http://" Тогда
		ПортСервера = ?(ПустаяСтрока(ПортСервера) Или ПортСервера = "80", "", ":" + ПортСервера);
	ИначеЕсли Протокол = "https://" Тогда
		ПортСервера = ?(ПустаяСтрока(ПортСервера) Или ПортСервера = "443", "", ":" + ПортСервера);
	Иначе                                                 
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный протокол: %1'", ОбщегоНазначения.КодОсновногоЯзыка()), Протокол);
	КонецЕсли;
	
	Путь = "/" + СтрСоединить(ЧастиАдреса, "/");
	
	Возврат Протокол + ИмяСервера + ПортСервера + Путь;
    
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.0.3";
	Обработчик.Процедура 			= "SUI_ЛогированиеHTTPЗапросов.ПриОбновленииНаВерсию_1_0_0_3";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Перезапись записей логирования HTTP запросов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.0.7";
	Обработчик.Процедура 			= "SUI_ЛогированиеHTTPЗапросов.ПриОбновленииНаВерсию_1_0_0_7";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Перезапись записей логирования HTTP запросов'");
	
КонецПроцедуры

Процедура ПриОбновленииНаВерсию_1_0_0_3() Экспорт
	
	// Перенести данные лог записей из ХранилищаЗначений в ресурсы строковых типов
	
	Если Метаданные.РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.Реквизиты.Найти("Удалить_Данные") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_ЛогиHTTPЗапросов.Период,
		|	SUI_ЛогиHTTPЗапросов.SID,
		|	SUI_ЛогиHTTPЗапросов.Метод,
		|	SUI_ЛогиHTTPЗапросов.Удалить_Данные
		|ИЗ
		|	РегистрСведений.SUI_ЛогированиеHTTPЗапросов КАК SUI_ЛогиHTTPЗапросов
		|ГДЕ
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(SUI_ЛогиHTTPЗапросов.ДанныеЗапроса КАК СТРОКА(3)) = ""   ""
		|		И ВЫРАЗИТЬ(SUI_ЛогиHTTPЗапросов.ДанныеОтвета КАК СТРОКА(3)) = ""   ""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОписаниеТипаСоответствие = Новый ОписаниеТипов("Соответствие");
	ОписаниеТипаСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(0);
	
	ВсегоЗаписей = Выборка.Количество();
	СчетчикПрогресса = 0;
	ТекущийСчетчик = 1;
	
	Пока Выборка.Следующий() Цикл
		
		Данные = ОписаниеТипаСтрока.ПривестиЗначение(Выборка.Удалить_Данные.Получить());
		Данные = ОписаниеТипаСоответствие.ПривестиЗначение(SUI_ЛогированиеHTTPЗапросовКлиентСервер.ДанныеJSON(Данные, Истина));
		
		ДанныеHTTPЗапрос = Данные.Получить("HTTPЗапрос");
		Если ДанныеHTTPЗапрос = Неопределено Тогда
			ДанныеHTTPЗапрос = Новый Структура("description", 
				НСтр("ru = 'Не удалось востановить данные записи логирования при обновлении на версию 1.0.0.3.'"));
		КонецЕсли;

		ДанныеHTTPОтвет = Данные.Получить("HTTPОтвет");
		Если ДанныеHTTPОтвет = Неопределено Тогда
			ДанныеHTTPОтвет = Новый Структура("description", 
				НСтр("ru = 'Не удалось востановить данные записи логирования при обновлении на версию 1.0.0.3.'"));
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.SID.Установить(Выборка.SID);
		НаборЗаписей.Отбор.Метод.Установить(Выборка.Метод);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			
			Для ИндексЗаписи = 0 По НаборЗаписей.Количество()-1 Цикл
				
				Если ИндексЗаписи = 0 Тогда
					НаборЗаписей[ИндексЗаписи].ДанныеЗапроса = SUI_ОбщегоНазначенияКлиентСервер.ДанныеВСтрокуJSON(
						ДанныеHTTPЗапрос, , "ПреобразованиеДанныхJSON", SUI_ЛогированиеHTTPЗапросовВызовСервера);
					НаборЗаписей[ИндексЗаписи].ДанныеОтвета = SUI_ОбщегоНазначенияКлиентСервер.ДанныеВСтрокуJSON(
						ДанныеHTTPОтвет, , "ПреобразованиеДанныхJSON", SUI_ЛогированиеHTTPЗапросовВызовСервера);
				Иначе
					НаборЗаписей.Удалить(НаборЗаписей[ИндексЗаписи]);
				КонецЕсли;

			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
		КонецЕсли;
		
		SUI_ОбновлениеSimple.СообщениеПрогессаВыполненияОбработчика(ВсегоЗаписей, СчетчикПрогресса, ТекущийСчетчик);
		ТекущийСчетчик = ТекущийСчетчик+1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриОбновленииНаВерсию_1_0_0_7() Экспорт
	
	// Измерение МобильноеУстройство не используется. Перенести код МУ в ресурс ИдентификаторУстройства
	
	Если Метаданные.РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.Измерения.Найти("Удалить_МобильноеУстройство") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_ЛогированиеHTTPЗапросов.Период,
		|	SUI_ЛогированиеHTTPЗапросов.SID,
		|	SUI_ЛогированиеHTTPЗапросов.Метод,
		|	SUI_ЛогированиеHTTPЗапросов.Удалить_МобильноеУстройство.Код КАК ИдентификаторУстройства
		|ИЗ
		|	РегистрСведений.SUI_ЛогированиеHTTPЗапросов КАК SUI_ЛогированиеHTTPЗапросов
		|ГДЕ
		|	SUI_ЛогированиеHTTPЗапросов.ИдентификаторУстройства = """"
		|	И
		|		SUI_ЛогированиеHTTPЗапросов.Удалить_МобильноеУстройство <> ЗНАЧЕНИЕ(ПланОбмена.SUI_МобильныеУстройства.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ВсегоЗаписей = Выборка.Количество();
	СчетчикПрогресса = 0;
	ТекущийСчетчик = 1;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ЛогированиеHTTPЗапросов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Период", "Период");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("SID", "SID");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Метод", "Метод");
		Блокировка.Заблокировать();
		
		Пока Выборка.Следующий() Цикл

			НаборЗаписей = РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
			НаборЗаписей.Отбор.SID.Установить(Выборка.SID);
			НаборЗаписей.Отбор.Метод.Установить(Выборка.Метод);
			
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				
				Для ИндексЗаписи = 0 По НаборЗаписей.Количество() - 1 Цикл
					
					Если ИндексЗаписи = 0 Тогда
						НаборЗаписей[ИндексЗаписи].ИдентификаторУстройства = Выборка.ИдентификаторУстройства;
					Иначе
						НаборЗаписей.Удалить(НаборЗаписей[ИндексЗаписи]);
					КонецЕсли;
					
				КонецЦикла;
				
				НаборЗаписей.Записать(Истина);
				
			КонецЕсли;
			
			SUI_ОбновлениеSimple.СообщениеПрогессаВыполненияОбработчика(ВсегоЗаписей, СчетчикПрогресса, ТекущийСчетчик);
			ТекущийСчетчик = ТекущийСчетчик+1;

		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыгрузитьЛогированиеHTTPЗапросовВФайл(ПараметрыВыгрузки, АдресХранения) Экспорт 
	
	Перем ФайлРезультат;
	
	Схема = РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.ПолучитьМакет("ПолучениеЗаписейЛогирования");

	Идентификаторы = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыВыгрузки, "Идентификаторы", Новый Массив(), Тип("Массив"));
	Если Идентификаторы.Количество() > 0 Тогда
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Схема.НастройкиПоУмолчанию, "SID", Идентификаторы, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;

	МакетКомпоновки = SUI_КомпоновкаДанныхСервер.ПолучитьМакетКомпоновки(Схема, Схема.НастройкиПоУмолчанию);
	Запрос = SUI_КомпоновкаДанныхСервер.ПолучитьЗапросИзМакетаКомпоновки(МакетКомпоновки, Схема.НаборыДанных[0].Имя);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда

		ПутьККаталогу = ПолучитьВременныйКаталогДляВыгрузкиЛогирования();
		
		Попытка

			ФайлыЛогирования = Новый Массив();
			
			ИменаСвойств = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);
			
			Записи = Новый Массив();
			
			ИндексЗаписи = 0;
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Если ИндексЗаписи = 10000 Тогда
					ФайлыЛогирования.Добавить(ЗаписатьДанныеВФайлJSON(Записи, ПутьККаталогу));
					Записи.Очистить();
					ИндексЗаписи = 0;
				КонецЕсли;
				
				ДанныеЗаписи = Новый Структура(ИменаСвойств);
				ЗаполнитьЗначенияСвойств(ДанныеЗаписи, Выборка);
				
				ДанныеЗаписи.request = ПрочиатьСтрокуJSONВДанные(ДанныеЗаписи.request);
				ДанныеЗаписи.response = ПрочиатьСтрокуJSONВДанные(ДанныеЗаписи.response);
				
				Записи.Добавить(ДанныеЗаписи);
				
				ИндексЗаписи = ИндексЗаписи+1;
				
			КонецЦикла;
			
			Если Записи.Количество() > 0 Тогда
				ФайлыЛогирования.Добавить(ЗаписатьДанныеВФайлJSON(Записи, ПутьККаталогу));
				Записи.Очистить();
				ИндексЗаписи = 0;
			КонецЕсли;
			
			Если ФайлыЛогирования.Количество() > 0 Тогда

				ФайлАрхив = Новый ЗаписьZipФайла();
				
				ДанныеМанифеста = Новый Структура();
				ДанныеМанифеста.Вставить("number_of_records", Выборка.Количество());
				ДанныеМанифеста.Вставить("files", Новый Массив());
				
				Для индекс = 0 По ФайлыЛогирования.ВГраница() Цикл
					ФайлАрхив.Добавить(ФайлыЛогирования[индекс]);
					ДанныеМанифеста.files.Добавить(СтрЗаменить(ФайлыЛогирования[индекс], ПутьККаталогу, ""));
				КонецЦикла;
				
				ФайлАрхив.Добавить(ЗаписатьДанныеВФайлJSON(ДанныеМанифеста, ПутьККаталогу, "manifest"));
	
				ФайлРезультат = ФайлАрхив.ПолучитьДвоичныеДанные(, , МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);
	
			КонецЕсли;

		Исключение
			ФайловаяСистема.УдалитьВременныйКаталог(ПутьККаталогу);
			ВызватьИсключение;
		КонецПопытки;
		
		ФайловаяСистема.УдалитьВременныйКаталог(ПутьККаталогу);
		
	КонецЕсли;

	Если ФайлРезультат = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Отсутствуют данные для сохранения'");
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ФайлРезультат, АдресХранения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытия(ВложенноеСобытие = "")
	Возврат НСтр("ru = 'Логирование'") + ?(ЗначениеЗаполнено(ВложенноеСобытие), ". " + ВложенноеСобытие, "");
КонецФункции

Функция ОписаниеЗапроса(Запрос, ДвоичныеДанные = Ложь)
	
	ПараметрыЗапроса = Неопределено;
	Если ТипЗнч(Запрос) = Тип("HTTPСервисЗапрос") Тогда
		Если Запрос.ПараметрыЗапроса.Количество() Тогда
			ПараметрыЗапроса = Новый Массив;
			Для Каждого КлючИЗначение Из Запрос.ПараметрыЗапроса Цикл
				ПараметрыЗапроса.Добавить(КлючИЗначение.Ключ + "=" + КодироватьСтроку(
					КлючИЗначение.Значение, СпособКодированияСтроки.КодировкаURL));
			КонецЦикла;
			ПараметрыЗапроса = "?" + СтрСоединить(ПараметрыЗапроса, "&");
		КонецЕсли;
		Адрес = Запрос.HTTPМетод + " " + БазовыйURL(Запрос) + Запрос.ОтносительныйURL + ПараметрыЗапроса;
	Иначе
		Адрес = Запрос.АдресРесурса;
	КонецЕсли;
	
	Заголовки = Новый Массив;
    Для Каждого Заголовок  Из Запрос.Заголовки Цикл
    	Заголовки.Добавить( СтрШаблон("%1: %2", Заголовок.Ключ, Заголовок.Значение));
	КонецЦикла;
	
	Если ДвоичныеДанные Тогда
		ТелоЗапроса = ПолучитьBase64СтрокуИзДвоичныхДанных(Запрос.ПолучитьТелоКакДвоичныеДанные());
	Иначе
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	КонецЕсли; 
	
	Если СтрДлина(ТелоЗапроса) > 1000 Тогда
		ТелоЗапроса = СтрШаблон(НСтр("ru = '%1...'"), Лев(ТелоЗапроса, 1000));
	КонецЕсли; 
    
    Возврат СтрШаблон(
        "%1
        |%2
        |
        |%3", Адрес, 
        СтрСоединить(Заголовки, Символы.ПС), ТелоЗапроса);
    
КонецФункции

Функция ОписаниеОтвета(Ответ, ДвоичныеДанные = Ложь)
    
    Заголовки = Новый Массив;
    Для Каждого Заголовок  Из Ответ.Заголовки Цикл
    	Заголовки.Добавить(СтрШаблон("%1: %2", Заголовок.Ключ, Заголовок.Значение));
    КонецЦикла; 
	
	Если ТипЗнч(Ответ) = Тип("HTTPСервисОтвет") Тогда
		КодСостояния = СтрШаблон("%1 %2", Ответ.КодСостояния, Ответ.Причина);
	Иначе
		КодСостояния = Ответ.КодСостояния
	КонецЕсли; 
	
	Если ДвоичныеДанные Тогда
		ТелоОтвета = ПолучитьBase64СтрокуИзДвоичныхДанных(Ответ.ПолучитьТелоКакДвоичныеДанные());
	Иначе
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли; 

	Если СтрДлина(ТелоОтвета) > 1000 Тогда
		ТелоОтвета = СтрШаблон(НСтр("ru = '%1...'"), Лев(ТелоОтвета, 1000));
	КонецЕсли; 
		
	Возврат СтрШаблон(
        "%1
        |%2
        |
        |%3", 
        КодСостояния,
        СтрСоединить(Заголовки, Символы.ПС), ТелоОтвета);
	
КонецФункции

Функция ПолучитьВременныйКаталогДляВыгрузкиЛогирования()
	Расширение = СтрШаблон("%1_logging", SUI_SimpleКлиентСервер.ИмяРасширения());
	Возврат ФайловаяСистема.СоздатьВременныйКаталог(Расширение);
КонецФункции

Функция СформироватьПутьКФайлуЛогирования(ПутьККаталогу, Знач ИмяФайла = "")
	
	Если ПустаяСтрока(ИмяФайла) Тогда
		ИмяФайла = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	КонецЕсли;
	
	Возврат ПутьККаталогу + ИмяФайла + ".json";
	
КонецФункции

Функция ОткрытьЗаписьJSON(ПутьКФайлу)

	Запись = Новый ЗаписьJSON();
	Запись.ОткрытьФайл(ПутьКФайлу, , , Новый ПараметрыЗаписиJSON(, Символы.Таб));
	
	Возврат Запись;
		
КонецФункции

Функция ЗаписатьДанныеВФайлJSON(Данные, ПутьККаталогу, ИмяФайла = "")
	
	ПутьКФайлу = СформироватьПутьКФайлуЛогирования(ПутьККаталогу, ИмяФайла);
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	
	НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON();
	НастройкиСериализацииJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ПутьКФайлу, , , ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные, НастройкиСериализацииJSON, "ПреобразованиеДанныхJSON", SUI_ЛогированиеHTTPЗапросов);
	ЗаписьJSON.Закрыть();
	
	Возврат ПутьКФайлу;
	
КонецФункции

Функция ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	Если Значение <> Неопределено Тогда
	
		ТипЗначения = XMLТипЗнч(Значение).ИмяТипа;
		
		Если ТипЗначения = Неопределено Тогда
			Возврат Null;
		ИначеЕсли СтрНайти(ТипЗначения, "Ref.") > 0 Или ТипЗначения = "UUID" Тогда
			Возврат Строка(Значение);
		КонецЕсли;

	КонецЕсли;

КонецФункции

Функция ПрочиатьСтрокуJSONВДанные(Строка)
	
	Результат = Новый Структура();
	
	Если Не ПустаяСтрока(ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Строка)) Тогда

		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Строка);
		Результат = ПрочитатьJSON(ЧтениеJSON, Истина);	
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
